--------------------------------------------------------------------------------
/*
    03.18(목) 실습
*/
--------------------------------------------------------------------------------
/*
    다중행 서브쿼리 복습 1
*/
--------------------------------------------------------------------------------
SELECT EMP_NAME, DEPT_TITLE, JOB_CODE
FROM EMPLOYEE
JOIN DEPARTMENT ON (DEPT_CODE = DEPT_ID)
--JOIN JOB USING(JOB_CODE)
--WHERE JOB_CODE NOT IN ('J1', 'J2');
WHERE JOB_CODE NOT IN (SELECT JOB_CODE FROM JOB WHERE JOB_NAME IN ('대표','부사장'));
SELECT JOB_CODE FROM JOB WHERE JOB_NAME IN ('대표','부사장');
--------------------------------------------------------------------------------
/*
    123
*/
--------------------------------------------------------------------------------